tutorials/incompressible/pimpleFoam/LES/periodicHill/steadyState/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    inletFaceSet;
        type    faceSet;
        action  new;
        source  patchToFace;
        patch   inlet;
    }
    {
        name    inletCellSet;
        type    cellSet;
        action  new;
        source  faceToCell;
        set     inletFaceSet;
        option  any;
    }
    {
        name    inletCellSet;
        type    cellSet;
        action  subset;
        source  boxToCell;
        box     (-100 -100 -100)(0.1 100 100);
    }
    {
        name    inletCellZone;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        set     inletCellSet;
    }
);


// ************************************************************************* //
